[
    {
        "product_title": "The Ultimate Guide to Game Development with Unity (Official)",
        "thumbnail_url": "https://img-c.udemycdn.com/course/240x135/1328572_b05d_5.jpg",
        "original_price": 199,
        "resale_price": 199,
        "years of use": 2,
        "posted_timeStamp": 123,
        "category": {
            "category_name": "Game Development",
            "category_id": "04"
        },
        "condition type": "good",
        "description": "This is a very Good Product"
    },
    // user table
    {
        "name": "moon",
        "email": "moon@gmail.com",
        "role": "admin",
        "address": {
            "mobile_number": "01686076447",
            "location": "Dhaka"
        },
        "verified": true
    }
    // order table
    {
        "buyer_name": "moon",
        "buyer_email": "moon@gmail.com",
        "address": {
            "mobile_number": "01686076447",
            "location": "Dhaka"
        },
        "verified": true
    }
]



















[
    {
      "product_name": "Super Cub C125",
      "product_img": "https://i.ibb.co/D92T4MF/img-models08.jpg",
      "product_description": "An upright, straight-backed riding position gives excellent all-round visibility, the seat uses high-density urethane foam for comfort and the handlebars are rubber-mounted. A new air-cooled, fuel-injected engine generates extra power with good-natured delivery. It’s also even more fuel efficient. And, just like the very first model, an automatic centrifugal clutch makes operating the four-speed gearbox twist-and-go simple. The tubular steel frame, telescopic forks, twin rear shocks (both with uprated springs) and cast aluminium, 17-inch wheels and tubeless tyres ensure dependable handling. Full LED lighting and Honda Smart Key are premium touches and for flexibility, the Super Cub C125 comes with a pillion seat ready mounted.",
      "used_time": "2",
      "product_condition": "good",
      "category_id": "637f7fc50a9cd6168efe98b5",
      "category_name" :"Honda",
      "seller_mobile": "01686076447",
      "seller_location": "Dhaka",
      "seller_name": "Setu Islam",
      "seller_email": "setu@islam.com",
      "original_price": "450000",
      "resell_price": "420000"
    },
    {
      "product_name": "CB1000R",
      "product_img": "https://i.ibb.co/ZgJxmLx/img-models05.jpg",
      "product_description": "The Honda CB1000R is a litre-class naked street bike which is the successor to the CB1000R Hornet previously sold in the country. It boasts of Honda’s new design language called ‘Neo Sports Café’ which was first showcased as a concept during the 2017 Tokyo Motor Show. The biggest highlight of the motorcycle is its styling. It has a minimalistic look with a sculpted fuel tank, brushed aluminium radiator covers and a front fender, complete with a round LED headlamp. It also gets a single-sided swingarm which adds to its style quotient.",
      "used_time": "1",
      "product_condition": "excellent",
      "category_id": "637f7fc50a9cd6168efe98b5",
      "category_name" :"Honda",
      "seller_mobile": "01686076447",
      "seller_location": "Dhaka",
      "seller_name": "Partho Rahman",
      "seller_email": "parto@rahman.com",
      "original_price": "550000",
      "resell_price": "500000"
    },
    {
      "product_name": "CBR1000RR-R FIREBLADE",
      "product_img": "https://i.ibb.co/kghK0Ng/img-models02.jpg",
      "product_description": "The Honda Fireblade rocked the Superbike world when we introduced it 30 years ago. And now it’s time to crack open some champagne. For 2022, we’re producing a special anniversary version of the CBR1000RR-R Fireblade SP, with special graphics. But there’s way, way more than that. We’ve reshaped the engine’s intake ports for higher mixture velocity and to boost midrange performance. A new throttle-return spring increases throttle linearity. Fine tuning our HSTC calibration with data from our World Superbike racers makes it even more seamless, and we’ve also made the quick-shift mechanism even quicker, for fewer engine-speed fluctuations. Finally, the front brakes feature new piston materials and surface treatment for better braking under load. All in all, the most awe-inspiring sportbike in our lineup is even better this year. That’s something to celebrate too!",
      "original_price": "750000",
      "resell_price": "720000",
      "used_time": "1",
      "product_condition": "excellent",
      "category_id": "637f7fc50a9cd6168efe98b5",
      "category_name" :"Honda",
      "seller_mobile": "01686076447",
      "seller_location": "Dhaka",
      "seller_name": "Partho Rahman",
      "seller_email": "parto@rahman.com"
    },
    {
      "product_name": "MT-10 SP",
      "product_img": "https://i.ibb.co/wK6L2Cg/mt-10-sp.png",
      "product_description": "The MT-10 SP is the first production motorcycle to be fitted with the Öhlins’ next generation electronically controlled suspension employing the latest spool valve damping. This state-of-the-art technology provides an even greater range of damping adjustments and a higher degree of response. Riders can choose between three semi-active damping modes (A-1, A-2, A-3), as well as three manual setting modes (M-1, M-2, M-3). When an automatic mode is selected the system adjusts rebound and compression damping continuously to match the current running conditions, ensuring the most appropriate settings are always in play. Manual modes allow precise electronic adjustment of compression and rebound damping for both the front fork and rear shock.",
      "original_price": "680000",
      "resell_price": "650000",
      "used_time": "5",
      "product_condition": "fair",
      "category_id": "637f7fc50a9cd6168efe98b8",
      "category_name" :"Yamaha",
      "seller_mobile": "01686076447",
      "seller_location": "Chittagong",
      "seller_name": "Partho Rahman",
      "seller_email": "parto@rahman.com"
    },
    {
      "product_name": "YZF-R1M",
      "product_img": "https://i.ibb.co/sPWHbbR/r1m.png",
      "product_description": "he YZF-R1M features beautifully integrated bodywork and sleek, stylish lines which create an unmistakably aggressive, aerodynamic profile. R1M riders are treated to even higher levels of fit and finish thanks to full carbon-fiber bodywork, including a carbon windscreen fairing, side fairings, front fender and tail section, matched to a polished aluminum swingarm and topped with a unique serial-numbered YZF-R1M badge on top of the airbox cover. A new-for-2022 styling update further accentuates the premium carbon fiber bodywork and stunning aluminum fuel tank.",
      "original_price": "780000",
      "resell_price": "730000",
      "used_time": "5",
      "product_condition": "excellent",
      "category_id": "637f7fc50a9cd6168efe98b8",
      "category_name" :"Yamaha",
      "seller_mobile": "01686076447",
      "seller_location": "Chittagong",
      "seller_name": "Partho Rahman",
      "seller_email": "parto@rahman.com"
    },
    {
      "product_name": "YZ450F MONSTER ENERGY ",
      "product_img": "https://i.ibb.co/R7jZBy3/yz-450-f-monster-energy.png",
      "product_description": "The all-new Traction Control System communicates wheel slip to the ECU, tuning the engine to maintain ideal rear wheel traction. Three levels can be selected: HIGH, LOW or OFF. The updated Launch Control System now features an rpm limiter which can be adjusted in 500 rpm increments between 6,000 rpm and 11,000 rpm for optimized launches when the gate drops. Both systems are controlled through the Yamaha Power Tuner App.",
      "original_price": "470000",
      "resell_price": "400000",
      "used_time": "4",
      "product_condition": "fair",
      "category_id": "637f7fc50a9cd6168efe98b8",
      "category_name" :"Yamaha",
      "seller_mobile": "01686076447",
      "seller_location": "Dhaka",
      "seller_name": "Setu Islam",
      "seller_email": "setu@islam.com"
    }
  ]